tangyangguang/Esp32_Fan_4P/src/fan/FanController.cpp
#include "fan/FanController.h"

#ifdef UNIT_TEST
#include <errno.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "Arduino.h"
#include "Esp32Base.h"
#else
#include <errno.h>
#include <stdlib.h>
#include <string.h>
#include <Arduino.h>
#include <Esp32Base.h>
#endif

namespace {
const char* CFG_NS = "fan";
const char* KEY_MIN_SPEED = "min_spd";
const char* KEY_SOFT_START = "soft_on";
const char* KEY_SOFT_STOP = "soft_off";
const char* KEY_BLOCK_DETECT = "blk_ms";
const char* KEY_SLEEP_WAIT = "slp_s";
const char* KEY_AUTO_RESTORE = "restore";
const char* KEY_LED_FLASH_MS = "led_ms";
const char* KEY_RUNTIME_SAVE_MIN = "rt_save_m";
const char* KEY_LAST_SPEED = "last_spd";
const char* KEY_LAST_TIMER = "last_tim";
const char* KEY_RUN_DURATION = "run_s";
const char* KEY_IR_ENTRY = "ir_";

// Gear to speed mapping
const uint8_t GEAR_SPEED[5] = {0, 25, 50, 75, 100};

bool cfgSetStr(const char* key, const char* value) {
    return Esp32BaseConfig::setStr(CFG_NS, key, value);
}

bool cfgGetStr(const char* key, char* out, size_t len, const char* def = "") {
    return Esp32BaseConfig::getStr(CFG_NS, key, out, len, def);
}

bool cfgSetInt(const char* key, int32_t value) {
    return Esp32BaseConfig::setInt(CFG_NS, key, value);
}

int32_t cfgGetInt(const char* key, int32_t def = 0) {
    return Esp32BaseConfig::getInt(CFG_NS, key, def);
}

bool cfgSetIntDeferred(const char* key, int32_t value) {
    return Esp32BaseConfig::setIntDeferred(CFG_NS, key, value);
}

bool cfgSetBool(const char* key, bool value) {
    return Esp32BaseConfig::setBool(CFG_NS, key, value);
}

bool cfgGetBool(const char* key, bool def = false) {
    return Esp32BaseConfig::getBool(CFG_NS, key, def);
}

bool parseIRCodeEntry(const char* value, uint8_t* protocol, uint64_t* code) {
    if (!value || !protocol || !code) return false;

    errno = 0;
    char* end = nullptr;
    unsigned long parsedProtocol = strtoul(value, &end, 10);
    if (end == value || *end != ':' || parsedProtocol > 255 || errno == ERANGE) return false;

    errno = 0;
    char* codeEnd = nullptr;
    unsigned long long parsedCode = strtoull(end + 1, &codeEnd, 16);
    if (codeEnd == end + 1 || *codeEnd != '\0' || errno == ERANGE) return false;

    *protocol = static_cast<uint8_t>(parsedProtocol);
    *code = static_cast<uint64_t>(parsedCode);
    return true;
}
}

FanController::FanController(FanDriver& fan, ButtonDriver& btn, LedIndicator& led, IRReceiverDriver& ir)
    : _fan(fan)
    , _btn(btn)
    , _led(led)
    , _ir(ir)
    , _state(SYS_IDLE)
    , _current_gear(0)
    , _target_speed(0)
    , _timer_remaining(0)
    , _run_duration(0)
    , _boot_run_duration(0)
    , _last_run_tick(0)
    , _last_operation_tick(0)
    , _last_runtime_save_tick(0)
    , _sleep_wait_time(60)
    , _soft_start_time(1000)
    , _soft_stop_time(1000)
    , _block_detect_time(1500)
    , _led_flash_duration_ms(200)
    , _runtime_save_interval_min(1)
    , _min_effective_speed(10)
    , _is_sleeping(false)
    , _auto_restore(true)
    , _recovery_start_tick(0)
    , _recovery_attempting(false)
    , _last_timer_tick(0) {
}

bool FanController::begin() {
    _fan.begin();
    _btn.begin();
    _led.begin();
    _ir.begin();

    _loadConfig();  // also applies soft-start/stop/block-detect to _fan

    _state = SYS_IDLE;
    _last_operation_tick = millis();

    // Power-on restore
    if (_auto_restore) {
        int32_t last_speed = cfgGetInt(KEY_LAST_SPEED, 0);
        int32_t last_timer = cfgGetInt(KEY_LAST_TIMER, 0);
        if (last_speed < 0) last_speed = 0;
        if (last_speed > 100) last_speed = 100;
        if (last_timer < 0) last_timer = 0;
        if (last_timer > 356400L) last_timer = 356400L;

        if (last_speed > 0) {
            ESP32BASE_LOG_I("FanCtrl", "Restoring last state: speed=%d%%, timer=%lds",
                      static_cast<int>(last_speed), static_cast<long>(last_timer));
            _timer_remaining = static_cast<uint32_t>(last_timer);
            _last_timer_tick = millis();
            _target_speed = static_cast<uint8_t>(last_speed);
            _syncGearFromSpeed(_target_speed);
            _applySpeed(_target_speed);
        } else {
            ESP32BASE_LOG_I("FanCtrl", "No restore needed (last_speed=0)");
        }
    } else {
        ESP32BASE_LOG_I("FanCtrl", "Auto-restore disabled");
    }

    _updateLedStatus();

    ESP32BASE_LOG_I("FanCtrl", "Controller ready, min_speed=%d%%, auto_restore=%s",
             _min_effective_speed, _auto_restore ? "true" : "false");
    return true;
}

void FanController::tick() {
    if (_state >= SYS_COUNT) {
        _state = SYS_ERROR;
    }

    // Advance fan state machine (soft start/stop, block detection, RPM)
    _fan.tick();

    switch (_state) {
        case SYS_IDLE:
            _handleIdle();
            break;
        case SYS_RUNNING:
            _handleRunning();
            break;
        case SYS_SLEEP:
            _handleSleep();
            break;
        case SYS_ERROR:
            _handleError();
            break;
        case SYS_RECOVERING:
            _handleRecovering();
            break;
        default:
            _state = SYS_ERROR;
            break;
    }

    _updateLedStatus();
    _led.tick();

    // Feed watchdog to prevent Soft WDT reset during heavy operations (e.g. Flash writes)
    yield();
}

SystemState FanController::getState() const { return _state; }
uint8_t FanController::getCurrentGear() const { return _current_gear; }
uint8_t FanController::getCurrentSpeed() const { return _fan.getSpeed(); }
uint8_t FanController::getTargetSpeed() const { return _target_speed; }
uint16_t FanController::getCurrentRpm() const { return _fan.getRpm(); }
uint32_t FanController::getTimerRemaining() const { return _timer_remaining; }
uint32_t FanController::getTotalRunDuration() const { return _run_duration; }
uint32_t FanController::getBootRunDuration() const { return _boot_run_duration; }
bool FanController::isBlocked() const { return _fan.isBlocked(); }
bool FanController::isSleeping() const { return _is_sleeping; }
bool FanController::getAutoRestore() const { return _auto_restore; }

bool FanController::setAutoRestore(bool enable) {
    bool ok = cfgSetBool(KEY_AUTO_RESTORE, enable);
    if (!ok) return false;

    _auto_restore = enable;
    if (_auto_restore) {
        ok = _saveRuntimeState(true);
    }
    return ok;
}

