tangyangguang/Esp32_Fan_4P/src/fan/FanController.cpp
bool FanController::setSpeed(uint8_t speed) {
    _last_operation_tick = millis();
    if (_is_sleeping) {
        _is_sleeping = false;
        Esp32BaseWiFi::setPowerSave(false);
    }

    if (speed > 100) speed = 100;
    if (speed > 0 && speed < _min_effective_speed) {
        speed = _min_effective_speed;
    }
    if (speed == 0) {
        return stop();
    }

    const uint8_t old_target = _target_speed;
    const uint8_t old_gear = _current_gear;
    _target_speed = speed;
    _syncGearFromSpeed(speed);

    bool ok = true;
    if (_state == SYS_ERROR || _state == SYS_RECOVERING) {
        if (!_saveRuntimeState(true)) {
            _target_speed = old_target;
            _current_gear = old_gear;
            ESP32BASE_LOG_W("FanCtrl", "Speed save failed before recovery: target=%u", (unsigned)speed);
            return false;
        }
        if (!_recovery_attempting) {
            _fan.resetBlock();
            _recovery_attempting = true;
            _recovery_start_tick = millis();
        }
        _state = SYS_RECOVERING;
        ok = _fan.setSpeed(speed);
    } else {
        ok = _applySpeed(speed, true);
    }
    if (!ok) {
        _target_speed = old_target;
        _current_gear = old_gear;
        _saveRuntimeState(true);
        ESP32BASE_LOG_W("FanCtrl", "Speed request failed: target=%u", (unsigned)speed);
        return false;
    }
    notifyUserAction();
    ESP32BASE_LOG_I("FanCtrl", "Speed requested: target=%u output=%u state=%u",
                      (unsigned)_target_speed, (unsigned)_fan.getSpeed(), (unsigned)_state);
    return true;
}

bool FanController::setTimer(uint32_t seconds) {
    if (seconds > 356400UL) return false;

    const uint32_t old_timer = _timer_remaining;
    const uint32_t old_timer_tick = _last_timer_tick;
    _timer_remaining = seconds;
    _last_timer_tick = millis();
    _last_operation_tick = millis();
    if (_is_sleeping) {
        _is_sleeping = false;
        Esp32BaseWiFi::setPowerSave(false);
    }
    if (!_saveRuntimeState(true)) {
        _timer_remaining = old_timer;
        _last_timer_tick = old_timer_tick;
        ESP32BASE_LOG_W("FanCtrl", "Timer save failed: seconds=%lu", static_cast<unsigned long>(seconds));
        return false;
    }

    if (seconds > 0) {
        ESP32BASE_LOG_I("FanCtrl", "Timer set: %lu seconds", static_cast<unsigned long>(seconds));
    } else {
        ESP32BASE_LOG_I("FanCtrl", "Timer cancelled");
    }
    notifyUserAction();
    return true;
}

bool FanController::stop() {
    _last_operation_tick = millis();
    if (_is_sleeping) {
        _is_sleeping = false;
        Esp32BaseWiFi::setPowerSave(false);
    }
    const uint32_t old_timer = _timer_remaining;
    const uint8_t old_target = _target_speed;
    const uint8_t old_gear = _current_gear;
    const SystemState old_state = _state;
    const bool old_recovery_attempting = _recovery_attempting;

    _timer_remaining = 0;
    _target_speed = 0;
    _current_gear = 0;
    _recovery_attempting = false;
    _state = SYS_IDLE;
    if (!_applySpeed(0, true)) {
        _timer_remaining = old_timer;
        _target_speed = old_target;
        _current_gear = old_gear;
        _state = old_state;
        _recovery_attempting = old_recovery_attempting;
        _saveRuntimeState(true);
        ESP32BASE_LOG_W("FanCtrl", "Stop request failed");
        return false;
    }
    notifyUserAction();
    ESP32BASE_LOG_I("FanCtrl", "Fan stopped by request");
    return true;
}

bool FanController::resetFactory() {
    bool ok = Esp32BaseConfig::clearNamespace(CFG_NS);
    ok = Esp32BaseConfig::clearLibraryNamespaces() && ok;
    ok = Esp32BaseConfig::flushAll() && ok;
    if (!ok) {
        ESP32BASE_LOG_E("FanCtrl", "Factory reset failed: config clear failed");
        return false;
    }
    ESP.restart();
    return true;
}

IRCodeChangeResult FanController::clearIRCode(uint8_t key_index) {
    if (key_index >= IR_KEY_COUNT) return IR_CODE_SAVE_FAILED;

    uint8_t proto = 0;
    uint64_t code = 0;
    _ir.getKeyCode(key_index, &proto, &code);
    if (proto == 0 && code == 0) return IR_CODE_NO_CHANGE;

    char key[20];
    snprintf(key, sizeof(key), "%s%d", KEY_IR_ENTRY, key_index);
    bool ok = cfgSetStr(key, "");
    ok = Esp32BaseConfig::flushAll() && ok;
    if (!ok) {
        ESP32BASE_LOG_W("FanCtrl", "IR code clear failed key=%u", key_index);
        return IR_CODE_SAVE_FAILED;
    }
    _ir.setKeyCode(key_index, 0, 0);
    ESP32BASE_LOG_I("FanCtrl", "IR code cleared key=%u", key_index);
    return IR_CODE_CHANGED;
}

void FanController::notifyUserAction() {
    _led.flashOnce();
}

uint8_t FanController::getMinEffectiveSpeed() const { return _min_effective_speed; }

bool FanController::setMinEffectiveSpeed(uint8_t speed) {
    if (speed > 50) speed = 50;
    if (!cfgSetInt(KEY_MIN_SPEED, speed)) return false;

    _min_effective_speed = speed;
    _fan.setMinEffectiveSpeed(_min_effective_speed);
    bool ok = true;
    if (_target_speed > 0 && _target_speed < _min_effective_speed) {
        _target_speed = _min_effective_speed;
        _syncGearFromSpeed(_target_speed);
        ok = _applySpeed(_target_speed, true) && ok;
    }
    return ok;
}

uint16_t FanController::getSoftStartTime() const {
    return _soft_start_time;
}

bool FanController::setSoftStartTime(uint16_t ms) {
    if (ms > 10000) ms = 10000;
    if (!cfgSetInt(KEY_SOFT_START, static_cast<int32_t>(ms))) return false;

    _soft_start_time = ms;
    _fan.setSoftStartTime(ms);
    return true;
}

uint16_t FanController::getSoftStopTime() const {
    return _soft_stop_time;
}

bool FanController::setSoftStopTime(uint16_t ms) {
    if (ms > 10000) ms = 10000;
    if (!cfgSetInt(KEY_SOFT_STOP, static_cast<int32_t>(ms))) return false;

    _soft_stop_time = ms;
    _fan.setSoftStopTime(ms);
    return true;
}

uint16_t FanController::getBlockDetectTime() const {
    return _block_detect_time;
}

bool FanController::setBlockDetectTime(uint16_t ms) {
    if (ms < 100) ms = 100;
    if (ms > 5000) ms = 5000;
    if (!cfgSetInt(KEY_BLOCK_DETECT, static_cast<int32_t>(ms))) return false;

    _block_detect_time = ms;
    _fan.setBlockDetectTime(ms);
    return true;
}

