tangyangguang/Esp32_Fan_4P/src/fan/FanController.cpp
uint16_t FanController::getSleepWaitTime() const { return _sleep_wait_time; }

bool FanController::setSleepWaitTime(uint16_t seconds) {
    if (seconds < 1) seconds = 1;
    if (seconds > 3600) seconds = 3600;
    if (!cfgSetInt(KEY_SLEEP_WAIT, seconds)) return false;

    _sleep_wait_time = seconds;
    return true;
}

uint16_t FanController::getLedFlashDuration() const {
    return _led_flash_duration_ms;
}

bool FanController::setLedFlashDuration(uint16_t ms) {
    if (ms > 2000) ms = 2000;
    if (!cfgSetInt(KEY_LED_FLASH_MS, static_cast<int32_t>(ms))) return false;

    _led_flash_duration_ms = ms;
    _led.setFlashDuration(_led_flash_duration_ms);
    return true;
}

uint8_t FanController::getRuntimeSaveIntervalMinutes() const {
    return _runtime_save_interval_min;
}

bool FanController::setRuntimeSaveIntervalMinutes(uint8_t minutes) {
    if (minutes < 1) minutes = 1;
    if (minutes > 60) minutes = 60;
    if (!cfgSetInt(KEY_RUNTIME_SAVE_MIN, static_cast<int32_t>(minutes))) return false;

    _runtime_save_interval_min = minutes;
    return true;
}

void FanController::_handleIdle() {
    _processButtonEvents();
    _processIREvents();
    _processTimer();
    _processSleep();
}

void FanController::_handleRunning() {
    _processButtonEvents();
    _processIREvents();
    _processTimer();

    uint32_t now = millis();
    bool duration_changed = false;
    while (now - _last_run_tick >= 1000) {
        _run_duration++;
        _boot_run_duration++;
        _last_run_tick += 1000;
        duration_changed = true;
    }
    if (duration_changed) {
        _saveRuntimeState();
    }

    if (_fan.isBlocked()) {
        _state = SYS_ERROR;
        ESP32BASE_LOG_E("FanCtrl", "BLOCK DETECTED! Transitioning to ERROR state");
        return;
    }

    if (_fan.getSpeed() == 0 && _fan.getState() == FAN_STATE_IDLE) {
        _state = SYS_IDLE;
        ESP32BASE_LOG_I("FanCtrl", "Fan stopped, transitioning to IDLE");
    }
}

void FanController::_handleSleep() {
    _processButtonEvents();
    _processIREvents();
    _processTimer();

    if (millis() - _last_operation_tick < 1000) {
        _is_sleeping = false;
        Esp32BaseWiFi::setPowerSave(false);
        if (_state == SYS_SLEEP) {
            _state = SYS_IDLE;
            ESP32BASE_LOG_I("FanCtrl", "Woken from sleep, transitioning to IDLE");
        }
    }
}

void FanController::_handleError() {
    if (_recovery_attempting) {
        _handleRecovering();
        return;
    }

    _processButtonEvents();
    _processIREvents();
    _processTimer();
}

void FanController::_handleRecovering() {
    _processButtonEvents();
    _processIREvents();
    _processTimer();

    if (!_recovery_attempting) {
        if (_state == SYS_RECOVERING) {
            _state = _fan.isBlocked() ? SYS_ERROR : SYS_RUNNING;
        }
        return;
    }

    if (_fan.getRpm() > 0) {
        _recovery_attempting = false;
        _state = SYS_RUNNING;
        _last_run_tick = millis();
        ESP32BASE_LOG_I("FanCtrl", "Recovery successful, back to RUNNING");
        return;
    }

    uint32_t elapsed = millis() - _recovery_start_tick;
    if (_fan.isBlocked() || elapsed >= _recoveryTimeoutMs()) {
        _recovery_attempting = false;
        _fan.resetBlock();
        _state = SYS_ERROR;
        ESP32BASE_LOG_W("FanCtrl", "Recovery failed, still blocked");
    }
}

void FanController::_processButtonEvents() {
    ButtonEvent event = _btn.getEvent();
    if (event == BTN_NONE) return;

    switch (event) {
        case BTN_ACCEL_SHORT:
            if (_current_gear < 4) {
                uint8_t next_gear = _current_gear + 1;
                uint8_t speed = GEAR_SPEED[next_gear];
                if (setSpeed(speed)) {
                    ESP32BASE_LOG_I("FanCtrl", "Button: Gear up to %d (%d%%)", _current_gear, speed);
                } else {
                    ESP32BASE_LOG_W("FanCtrl", "Button gear up failed target=%u", (unsigned)speed);
                }
            }
            break;

        case BTN_DECEL_SHORT:
            if (_current_gear > 0) {
                uint8_t next_gear = _current_gear - 1;
                uint8_t speed = GEAR_SPEED[next_gear];
                if (setSpeed(speed)) {
                    ESP32BASE_LOG_I("FanCtrl", "Button: Gear down to %d (%d%%)", _current_gear, speed);
                } else {
                    ESP32BASE_LOG_W("FanCtrl", "Button gear down failed target=%u", (unsigned)speed);
                }
            }
            break;

        case BTN_BOTH_LONG:
            ESP32BASE_LOG_I("FanCtrl", "Both buttons long press -> factory reset");
            resetFactory();
            break;

        default:
            break;
    }
}

void FanController::_processIREvents() {
    IREvent event = _ir.getEvent();
    if (_ir.consumeLearnedCode()) {
        uint8_t key = _ir.getLearnedKeyIndex();
        if (_saveIRCode(key)) {
            notifyUserAction();
            ESP32BASE_LOG_I("FanCtrl", "IR learned code persisted key=%u", key);
        } else {
            ESP32BASE_LOG_W("FanCtrl", "IR learned code persist failed key=%u", key);
        }
    }
    if (event == IR_EVENT_NONE) return;

    switch (event) {
        case IR_EVENT_SPEED_UP:
            if (_current_gear < 4) {
                uint8_t next_gear = _current_gear + 1;
                uint8_t speed = GEAR_SPEED[next_gear];
                if (setSpeed(speed)) {
                    ESP32BASE_LOG_I("FanCtrl", "IR: Gear up to %d (%d%%)", _current_gear, speed);
                } else {
                    ESP32BASE_LOG_W("FanCtrl", "IR gear up failed target=%u", (unsigned)speed);
                }
            }
            break;

        case IR_EVENT_SPEED_DOWN:
            if (_current_gear > 0) {
                uint8_t next_gear = _current_gear - 1;
                uint8_t speed = GEAR_SPEED[next_gear];
                if (setSpeed(speed)) {
                    ESP32BASE_LOG_I("FanCtrl", "IR: Gear down to %d (%d%%)", _current_gear, speed);
                } else {
                    ESP32BASE_LOG_W("FanCtrl", "IR gear down failed target=%u", (unsigned)speed);
                }
            }
            break;

        case IR_EVENT_STOP:
            if (!stop()) {
                ESP32BASE_LOG_W("FanCtrl", "IR stop failed");
            }
            break;

        case IR_EVENT_TIMER_30M:
            if (setTimer(1800)) ESP32BASE_LOG_I("FanCtrl", "IR: Timer set 30min");
            else ESP32BASE_LOG_W("FanCtrl", "IR timer 30min failed");
            break;

        case IR_EVENT_TIMER_1H:
            if (setTimer(3600)) ESP32BASE_LOG_I("FanCtrl", "IR: Timer set 1h");
            else ESP32BASE_LOG_W("FanCtrl", "IR timer 1h failed");
            break;

