tangyangguang/Esp32_Fan_4P/src/fan/FanController.cpp
        case IR_EVENT_TIMER_2H:
            if (setTimer(7200)) ESP32BASE_LOG_I("FanCtrl", "IR: Timer set 2h");
            else ESP32BASE_LOG_W("FanCtrl", "IR timer 2h failed");
            break;

        case IR_EVENT_TIMER_4H:
            if (setTimer(14400)) ESP32BASE_LOG_I("FanCtrl", "IR: Timer set 4h");
            else ESP32BASE_LOG_W("FanCtrl", "IR timer 4h failed");
            break;

        case IR_EVENT_TIMER_8H:
            if (setTimer(28800)) ESP32BASE_LOG_I("FanCtrl", "IR: Timer set 8h");
            else ESP32BASE_LOG_W("FanCtrl", "IR timer 8h failed");
            break;

        default:
            break;
    }
}

void FanController::_processTimer() {
    if (_timer_remaining == 0) return;

    uint32_t now = millis();
    bool timer_changed = false;

    while (_timer_remaining > 0 && now - _last_timer_tick >= 1000) {
        _timer_remaining--;
        _last_timer_tick += 1000;
        timer_changed = true;
    }

    if (!timer_changed) return;

    if (_timer_remaining == 0) {
        if (stop()) {
            ESP32BASE_LOG_I("FanCtrl", "Timer expired, fan stopped");
        } else {
            ESP32BASE_LOG_W("FanCtrl", "Timer expired but stop failed");
        }
    } else if (_timer_remaining <= 60 && _timer_remaining % 10 == 0) {
        ESP32BASE_LOG_D("FanCtrl", "Timer remaining: %lus", static_cast<unsigned long>(_timer_remaining));
    }
    _saveRuntimeState(_timer_remaining <= 60 && _timer_remaining % 10 == 0);
}

void FanController::_processSleep() {
    if (_fan.getSpeed() != 0) {
        _last_operation_tick = millis();
        return;
    }

    // Only enter modem sleep after STA is connected. Entering before connection
    // can interfere with WiFi association and provides no useful power saving.
    if (!Esp32BaseWiFi::isConnected()) {
        _last_operation_tick = millis();
        return;
    }

    uint32_t idle_time = millis() - _last_operation_tick;
    if (idle_time >= (_sleep_wait_time * 1000UL)) {
        _is_sleeping = true;
        _state = SYS_SLEEP;

        // Enter modem sleep to save power
        Esp32BaseWiFi::setPowerSave(true);
        
        ESP32BASE_LOG_I("FanCtrl", "Entering sleep mode (Modem Sleep), idle=%lus",
                 static_cast<unsigned long>(idle_time / 1000));
    }
}

uint32_t FanController::_recoveryTimeoutMs() const {
    return static_cast<uint32_t>(_soft_start_time) +
           static_cast<uint32_t>(_block_detect_time) + 500UL;
}

bool FanController::_applySpeed(uint8_t speed, bool force_save) {
    if (force_save && !_saveRuntimeState(true)) {
        return false;
    }
    bool ok = _fan.setSpeed(speed);
    if (ok) {
        if (speed > 0) {
            _state = SYS_RUNNING;
            _last_run_tick = millis();
        }
    } else if (force_save) {
        ESP32BASE_LOG_W("FanCtrl", "Fan driver rejected speed=%u after runtime save", (unsigned)speed);
    }
    return ok;
}

bool FanController::_saveRuntimeState(bool force) {
    uint32_t now = millis();

    // Throttle Flash writes. UI uses in-memory counters; persistence can lag to reduce wear.
    uint32_t interval_ms = static_cast<uint32_t>(_runtime_save_interval_min) * 60000UL;
    if (!force && now - _last_runtime_save_tick < interval_ms) return true;
    _last_runtime_save_tick = now;

    bool ok = true;
    if (_auto_restore) {
        ok = cfgSetIntDeferred(KEY_LAST_SPEED, _target_speed) && ok;
        ok = cfgSetIntDeferred(KEY_LAST_TIMER, static_cast<int32_t>(_timer_remaining)) && ok;
    }
    ok = cfgSetIntDeferred(KEY_RUN_DURATION, static_cast<int32_t>(_run_duration)) && ok;
    if (force) {
        ok = Esp32BaseConfig::flushAll() && ok;
    }
    return ok;
}

void FanController::_syncGearFromSpeed(uint8_t speed) {
    if (speed == 0) {
        _current_gear = 0;
    } else if (speed <= GEAR_SPEED[1]) {
        _current_gear = 1;
    } else if (speed <= GEAR_SPEED[2]) {
        _current_gear = 2;
    } else if (speed <= GEAR_SPEED[3]) {
        _current_gear = 3;
    } else {
        _current_gear = 4;
    }
}

void FanController::_updateLedStatus() {
    if (_state == SYS_ERROR || _state == SYS_RECOVERING || _fan.isBlocked()) {
        _led.setOverride(LED_FAST_BLINK);
    } else if (!Esp32BaseWiFi::isConnected()) {
        _led.setOverride(LED_SLOW_BLINK);
    } else {
        _led.setGear(_current_gear);
    }
}

void FanController::_loadConfig() {
    int32_t min_speed = cfgGetInt(KEY_MIN_SPEED, 10);
    if (min_speed < 0) min_speed = 10;
    if (min_speed > 50) min_speed = 50;
    _min_effective_speed = static_cast<uint8_t>(min_speed);
    _sleep_wait_time = static_cast<uint16_t>(
        cfgGetInt(KEY_SLEEP_WAIT, 60));
    if (_sleep_wait_time < 1) _sleep_wait_time = 1;
    if (_sleep_wait_time > 3600) _sleep_wait_time = 3600;
    _auto_restore = cfgGetBool(KEY_AUTO_RESTORE, true);
    int32_t led_flash_ms = cfgGetInt(KEY_LED_FLASH_MS, 200);
    if (led_flash_ms < 0) led_flash_ms = 0;
    if (led_flash_ms > 2000) led_flash_ms = 2000;
    _led_flash_duration_ms = static_cast<uint16_t>(led_flash_ms);
    _led.setFlashDuration(_led_flash_duration_ms);
    int32_t runtime_save_min = cfgGetInt(KEY_RUNTIME_SAVE_MIN, 1);
    if (runtime_save_min < 1) runtime_save_min = 1;
    if (runtime_save_min > 60) runtime_save_min = 60;
    _runtime_save_interval_min = static_cast<uint8_t>(runtime_save_min);

    int32_t soft_start = cfgGetInt(KEY_SOFT_START, 1000);
    int32_t soft_stop = cfgGetInt(KEY_SOFT_STOP, 1000);
    int32_t block_detect = cfgGetInt(KEY_BLOCK_DETECT, 1500);
    if (soft_start < 0) soft_start = 0;
    if (soft_start > 10000) soft_start = 10000;
    if (soft_stop < 0) soft_stop = 0;
    if (soft_stop > 10000) soft_stop = 10000;
    if (block_detect < 100) block_detect = 100;
    if (block_detect > 5000) block_detect = 5000;

    _soft_start_time = static_cast<uint16_t>(soft_start);
    _soft_stop_time = static_cast<uint16_t>(soft_stop);
    _block_detect_time = static_cast<uint16_t>(block_detect);
    _fan.setMinEffectiveSpeed(_min_effective_speed);
    _fan.setSoftStartTime(_soft_start_time);
    _fan.setSoftStopTime(_soft_stop_time);
    _fan.setBlockDetectTime(_block_detect_time);

    int32_t run_duration = cfgGetInt(KEY_RUN_DURATION, 0);
    if (run_duration < 0) run_duration = 0;
    _run_duration = static_cast<uint32_t>(run_duration);

    // Load IR codes. Each learned key is stored as one protocol:code value.
    char key[20];
    for (uint8_t i = 0; i < IR_KEY_COUNT; i++) {
        uint8_t proto = 0;
        uint64_t code = 0;
        char value[32];
        snprintf(key, sizeof(key), "%s%d", KEY_IR_ENTRY, i);
        if (cfgGetStr(key, value, sizeof(value), "")) {
            if (parseIRCodeEntry(value, &proto, &code)) {
                _ir.setKeyCode(i, proto, code);
            } else if (value[0] != '\0') {
                ESP32BASE_LOG_W("FanCtrl", "Invalid IR config ignored key=%u", i);
            }
        }
    }
}

bool FanController::_saveIRCode(uint8_t key_index) {
    if (key_index >= IR_KEY_COUNT) return false;

    char key[20];
    uint8_t proto;
    uint64_t code;
    _ir.getKeyCode(key_index, &proto, &code);
    if (proto == 0 && code == 0) return true;

    char value[32];
    char current[32];
    snprintf(key, sizeof(key), "%s%d", KEY_IR_ENTRY, key_index);
    snprintf(value, sizeof(value), "%u:%016llX", proto, static_cast<unsigned long long>(code));
    bool hadCurrent = cfgGetStr(key, current, sizeof(current), "");
    if (hadCurrent) {
        uint8_t currentProto = 0;
        uint64_t currentCode = 0;
        if (parseIRCodeEntry(current, &currentProto, &currentCode) &&
            currentProto == proto && currentCode == code) {
            ESP32BASE_LOG_I("FanCtrl", "IR learned code unchanged key=%u", key_index);
            return true;
        }
    }
    bool ok = cfgSetStr(key, value);
    ok = Esp32BaseConfig::flushAll() && ok;
    if (!ok) {
        uint8_t oldProto = 0;
        uint64_t oldCode = 0;
        if (hadCurrent && parseIRCodeEntry(current, &oldProto, &oldCode)) {
            _ir.setKeyCode(key_index, oldProto, oldCode);
            cfgSetStr(key, current);
        } else {
            _ir.setKeyCode(key_index, 0, 0);
            cfgSetStr(key, "");
        }
        Esp32BaseConfig::flushAll();
        return false;
    }
    return true;
}

#ifdef UNIT_TEST
void FanController::_saveConfig() {
    cfgSetInt(KEY_MIN_SPEED, _min_effective_speed);
    cfgSetInt(KEY_SOFT_START, _soft_start_time);
    cfgSetInt(KEY_SOFT_STOP, _soft_stop_time);
    cfgSetInt(KEY_BLOCK_DETECT, _block_detect_time);
    cfgSetInt(KEY_SLEEP_WAIT, _sleep_wait_time);
    cfgSetBool(KEY_AUTO_RESTORE, _auto_restore);
    cfgSetInt(KEY_LED_FLASH_MS, static_cast<int32_t>(_led_flash_duration_ms));
    cfgSetInt(KEY_RUNTIME_SAVE_MIN, static_cast<int32_t>(_runtime_save_interval_min));
}

void FanController::_saveIRCodes() {
    for (uint8_t i = 0; i < IR_KEY_COUNT; i++) {
        _saveIRCode(i);
    }
}
#endif
